cases/T0_cavity/Allrun
#!/bin/sh
#------------------------------------------------------------------------------
# T0 - lid-driven cavity 128x128 (spec 13)
#
#   ./Allrun [-solver coupledFoam|simpleFoam] [-np N] [-Re 100|1000]
#            [-mesh-only]
#
# Defaults: coupledFoam, 1 rank, Re 100. Deterministic for a given rank count.
# Parallel runs use scotch and mpirun --bind-to core --map-by core.
#------------------------------------------------------------------------------
cd "${0%/*}" || exit 1
. "${WM_PROJECT_DIR:?}"/bin/tools/RunFunctions

solver=coupledFoam
np=1
Re=100
meshOnly=false

while [ "$#" -gt 0 ]
do
    case "$1" in
        -solver) solver="$2"; shift 2 ;;
        -np) np="$2"; shift 2 ;;
        -Re) Re="$2"; shift 2 ;;
        -mesh-only) meshOnly=true; shift ;;
        *) echo "Unknown option $1" 1>&2; exit 1 ;;
    esac
done

# nu = U_lid L / Re with U_lid = 1, L = 0.1
nu=$(awk -v re="$Re" 'BEGIN { printf "%.10g", 0.1/re }')
foamDictionary -entry nu -set "$nu" constant/transportProperties > /dev/null
foamDictionary -entry application -set "$solver" system/controlDict > /dev/null

restore0Dir
runApplication blockMesh

[ "$meshOnly" = true ] && exit 0

if [ "$np" -gt 1 ]
then
    foamDictionary -entry numberOfSubdomains -set "$np" system/decomposeParDict > /dev/null
    runApplication decomposePar -force
    mpirun --bind-to core --map-by core -np "$np" "$solver" -parallel > "log.$solver" 2>&1
else
    runApplication "$solver"
fi

#------------------------------------------------------------------------------
