cases/T0_cavity/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T0 - laminar
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;

// ************************************************************************* //
