cases/T0_cavity/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T0 - numberOfSubdomains is set by Allrun
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;

method              scotch;

// ************************************************************************* //
